/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 13909                             :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: sovla <boj.kr/u/sovla>                      +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/13909                          #+#        #+#      #+#    */
/*   Solved: 2025/03/01 23:11:11 by sovla         ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */

const fs = require("fs");
const N = +fs.readFileSync("/dev/stdin").toString().trim();

// 창문이 토글 되는 수는 약수가 홀수인 경우에 해당함
// 약수가 홀수인 경우는 완전 제곱수만 존재하며
// 주어진 N의 제곱근을 얻으면 아래에 완전 제곱수가 몇개인지 확인이 가능하고 그 값이 정답
console.log(Math.floor(Math.sqrt(N)));
