/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 1904                              :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: sovla <boj.kr/u/sovla>                      +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/1904                           #+#        #+#      #+#    */
/*   Solved: 2025/03/13 14:38:24 by sovla         ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */

const fs = require("fs");
const N = +fs.readFileSync("/dev/stdin").toString().trim();

const mod = 15746;
// dp[i]는 길이가 i인 수열의 개수를 의미합니다.
const dp = new Array(N + 1).fill(0);
dp[0] = 1; // 빈 수열의 경우 1가지 경우의 수로 취급
dp[1] = 1; // 길이 1일 때는 '1'만 올 수 있음

for (let i = 2; i <= N; i++) {
  dp[i] = (dp[i - 1] + dp[i - 2]) % mod;
}

console.log(dp[N]);
